# Pandas

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### 1

In [2]:
df1 = DataFrame({'Key': ['X', 'Y', 'Z'], 'Data_set_one': ['1', '2', '3']})
df1

  Key Data_set_one
0   X            1
1   Y            2
2   Z            3

In [8]:
df2 = DataFrame({'Key': ['A', 'B', 'C'], 'Data_set_two': ['4', '5', '6']})
df2

  Key Data_set_two
0   A            4
1   B            5
2   C            6

In [9]:
df3 = pd.merge(df1, df2)
df3

Empty DataFrame
Columns: [Key, Data_set_one, Data_set_two]
Index: []

### 2

In [15]:
df4 = DataFrame({'Key': ['X', 'Y', 'Z'], 'Data_set_one': ['1', '2', '3']})
df4

  Key Data_set_one
0   X            1
1   Y            2
2   Z            3

In [16]:
df5 = DataFrame({'Key': ['A', 'X', 'C'], 'Data_set_two': ['4', '5', '6']})
df5

  Key Data_set_two
0   A            4
1   X            5
2   C            6

In [17]:
df6 = pd.merge(df4, df5)
df6

  Key Data_set_one Data_set_two
0   X            1            5

### 3

In [18]:
df7 = DataFrame({'Key': ['X', 'Y', 'Z'], 'Data_set_one': ['1', '2', '3']})
df7

  Key Data_set_one
0   X            1
1   Y            2
2   Z            3

In [19]:
df8 = DataFrame({'Key': ['A', 'X', 'X'], 'Data_set_two': ['4', '5', '6']})
df8

  Key Data_set_two
0   A            4
1   X            5
2   X            6

In [20]:
df9 = pd.merge(df7, df8)
df9

  Key Data_set_one Data_set_two
0   X            1            5
1   X            1            6

### 4

In [21]:
df10 = DataFrame({'Key': ['X', 'Y', 'Z'], 'Data_set_one': ['1', '2', '3']})
df11 = DataFrame({'Key': ['A', 'B', 'Z'], 'Data_set_two': ['4', '5', '6']})
df12 = pd.merge(df10, df11, on='Key')
df12

  Key Data_set_one Data_set_two
0   Z            3            6

### 5

In [22]:
df10

  Key Data_set_one
0   X            1
1   Y            2
2   Z            3

In [23]:
df11

  Key Data_set_two
0   A            4
1   B            5
2   Z            6

In [24]:
df13 = pd.merge(df10, df11, how='left', on='Key')
df13

  Key Data_set_one Data_set_two
0   X            1          NaN
1   Y            2          NaN
2   Z            3            6

In [25]:
df14 = pd.merge(df10, df11, how='right', on='Key')
df14

  Key Data_set_one Data_set_two
0   Z            3            6
1   A          NaN            4
2   B          NaN            5

In [26]:
df15 = pd.merge(df10, df11, how='outer', on='Key')
df15

  Key Data_set_one Data_set_two
0   X            1          NaN
1   Y            2          NaN
2   Z            3            6
3   A          NaN            4
4   B          NaN            5